app/controllers/products_controller.rb

  def index
    @products = Product.order("name").page(params[:page]).per(3)
---
SELECT COUNT(*) FROM `products`

  def edit
    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`name`, `created_at`, `updated_at`) VALUES ('All-New Log For Girls', '2011-05-02 22:12:31', '2011-05-02 22:12:31')

  def update
    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1